askn37/multix-zinnia-sdk-modernAVR/boards.txt
menu.01_variant=Variant
menu.02_clock=Clock
menu.11_BODMODE=BOD Mode
menu.12_BODLVL=BOD Level
menu.21_resetpin=FUSE PF6
menu.22_updipin=FUSE UPDI
menu.23_eeprom=FUSE EEPROM
menu.24_mvsyscfg=FUSE MVIO
menu.51_buildopt=Build Option
menu.52_macroapi=Build API
menu.53_printf=Build "printf"
menu.54_console_select=Console and LED
menu.90_console_baud=Console
menu.95_bootloader=Bootloader


AVRDB.name=AVR DB with Bootloader
AVRDB.build.board=AVR128DB64
AVRDB.build.core=modernAVR
AVRDA.name=AVR DA with Bootloader
AVRDA.build.board=AVR128DA64
AVRDA.build.core=modernAVR
AVRDD.name=AVR DD with Bootloader
AVRDD.build.board=AVR64DD32
AVRDD.build.core=modernAVR
AVRDD14.name=AVR DD 14pin with Bootloader
AVRDD14.build.board=AVR32DD14
AVRDD14.build.core=modernAVR
separator.name=-
separator.build.board=-
AVRDB_noloader.name=AVR DB w/o Bootloader
AVRDB_noloader.build.board=AVR128DB64
AVRDB_noloader.build.core=modernAVR
AVRDA_noloader.name=AVR DA w/o Bootloader
AVRDA_noloader.build.board=AVR128DA64
AVRDA_noloader.build.core=modernAVR
AVRDD_noloader.name=AVR DD w/o Bootloader
AVRDD_noloader.build.board=AVR64DD32
AVRDD_noloader.build.core=modernAVR


AVRDB.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDB.bootloader.BOOTSIZE=0x01
AVRDB.bootloader.CODESIZE=0x00
AVRDB.bootloader.OSCCFG=0b00000000
AVRDB.bootloader.SYSCFG0=0b110{bootloader.updi_bit}{bootloader.reset_bit}0{bootloader.eesave_bit}
AVRDB.bootloader.SYSCFG1=0b0000{bootloader.mvsys_bit}000
AVRDB.bootloader.WDTCFG=0b00000000
AVRDB.bootloader.bod_lvl=000
AVRDB.bootloader.bod_mode=00
AVRDB.bootloader.bod_sample=0
AVRDB.bootloader.tool=avrdude
AVRDB.bootloader.eepupload=
AVRDB.bootloader.eesave_bit=1
AVRDB.bootloader.mvsys_bit=01
AVRDB.bootloader.reset_bit=10
AVRDB.bootloader.updi_bit=1
AVRDB.bootloader.programed_type=.with_bootloader
AVRDB.build.export_merged_output=true
AVRDB.build.text_section_start=.text=0x200
AVRDB.build.buildopt=-DNDEBUG
AVRDB.build.console_baud=-DCONSOLE_BAUD=9600
AVRDB.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVRDB.build.macroapi=-DENABLE_MACRO_API
AVRDB.build.printf=
AVRDB.build.printflt=
AVRDB.upload.protocol=arduino
AVRDB.upload.speed=115200
AVRDB.upload.tool=avrdude
AVRDB.menu.01_variant.01.build.board=AVR_AVR128DB64
AVRDB.menu.01_variant.01.build.mcu=avr128db64
AVRDB.menu.01_variant.01.build.variant=avr_db64
AVRDB.menu.01_variant.01.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega4.x
AVRDB.menu.01_variant.01.upload.maximum_data_size=16384
AVRDB.menu.01_variant.01.upload.maximum_size=130560
AVRDB.menu.01_variant.01=64pin AVR128DB64 (128KiB+16KiB)
AVRDB.menu.01_variant.02.build.board=AVR_AVR64DB64
AVRDB.menu.01_variant.02.build.mcu=avr64db64
AVRDB.menu.01_variant.02.build.variant=avr_db64
AVRDB.menu.01_variant.02.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2.x
AVRDB.menu.01_variant.02.upload.maximum_data_size=8192
AVRDB.menu.01_variant.02.upload.maximum_size=65024
AVRDB.menu.01_variant.02=64pin AVR64DB64 (64KiB+8KiB)
AVRDB.menu.01_variant.10=-
AVRDB.menu.01_variant.11.build.board=AVR_AVR128DB48
AVRDB.menu.01_variant.11.build.mcu=avr128db48
AVRDB.menu.01_variant.11.build.variant=avr_db48
AVRDB.menu.01_variant.11.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega4.x
AVRDB.menu.01_variant.11.upload.maximum_data_size=16384
AVRDB.menu.01_variant.11.upload.maximum_size=130560
AVRDB.menu.01_variant.11=48pin AVR128DB48 (128KiB+16KiB)
AVRDB.menu.01_variant.12.build.board=AVR_AVR64DB48
AVRDB.menu.01_variant.12.build.mcu=avr64db48
AVRDB.menu.01_variant.12.build.variant=avr_db48
AVRDB.menu.01_variant.12.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2.x
AVRDB.menu.01_variant.12.upload.maximum_data_size=8192
AVRDB.menu.01_variant.12.upload.maximum_size=65024
AVRDB.menu.01_variant.12=48pin AVR64DB48 (64KiB+8KiB)
AVRDB.menu.01_variant.13.build.board=AVR_AVR32DB48
AVRDB.menu.01_variant.13.build.mcu=avr32db48
AVRDB.menu.01_variant.13.build.variant=avr_db48
AVRDB.menu.01_variant.13.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3.x
AVRDB.menu.01_variant.13.upload.maximum_data_size=4096
AVRDB.menu.01_variant.13.upload.maximum_size=32256
AVRDB.menu.01_variant.13=48pin AVR32DB48 (32KiB+4KiB)
AVRDB.menu.01_variant.20=-
AVRDB.menu.01_variant.21.build.board=AVR_AVR128DB32
AVRDB.menu.01_variant.21.build.mcu=avr128db32
AVRDB.menu.01_variant.21.build.variant=avr_db32
AVRDB.menu.01_variant.21.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega4.x
AVRDB.menu.01_variant.21.upload.maximum_data_size=16384
AVRDB.menu.01_variant.21.upload.maximum_size=130560
AVRDB.menu.01_variant.21=32pin AVR128DB32 (128KiB+16KiB)
AVRDB.menu.01_variant.22.build.board=AVR_AVR64DB32
AVRDB.menu.01_variant.22.build.mcu=avr64db32
AVRDB.menu.01_variant.22.build.variant=avr_db32
AVRDB.menu.01_variant.22.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2.x
AVRDB.menu.01_variant.22.upload.maximum_data_size=8192
AVRDB.menu.01_variant.22.upload.maximum_size=65024
AVRDB.menu.01_variant.22=32pin AVR64DB32 (64KiB+8KiB)
AVRDB.menu.01_variant.23.build.board=AVR_AVR32DB32
AVRDB.menu.01_variant.23.build.mcu=avr32db32
AVRDB.menu.01_variant.23.build.variant=avr_db32
AVRDB.menu.01_variant.23.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3.x
AVRDB.menu.01_variant.23.upload.maximum_data_size=4096
AVRDB.menu.01_variant.23.upload.maximum_size=32256
AVRDB.menu.01_variant.23=32pin AVR32DB32 (32KiB+4KiB)
AVRDB.menu.01_variant.30=-
AVRDB.menu.01_variant.31.build.board=AVR_AVR128DA28
AVRDB.menu.01_variant.31.build.mcu=avr128db28
AVRDB.menu.01_variant.31.build.variant=avr_db28
AVRDB.menu.01_variant.31.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega4.x
AVRDB.menu.01_variant.31.upload.maximum_data_size=16384
AVRDB.menu.01_variant.31.upload.maximum_size=130560
AVRDB.menu.01_variant.31=28pin AVR128DA28 (128KiB+16KiB)
AVRDB.menu.01_variant.32.build.board=AVR_AVR64DA28
AVRDB.menu.01_variant.32.build.mcu=avr64db28
AVRDB.menu.01_variant.32.build.variant=avr_db28
AVRDB.menu.01_variant.32.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2.x
AVRDB.menu.01_variant.32.upload.maximum_data_size=8192
AVRDB.menu.01_variant.32.upload.maximum_size=65024
AVRDB.menu.01_variant.32=28pin AVR64DA28 (64KiB+8KiB)
AVRDB.menu.01_variant.33.build.board=AVR_AVR32DA28
AVRDB.menu.01_variant.33.build.mcu=avr32db28
AVRDB.menu.01_variant.33.build.variant=avr_db28
AVRDB.menu.01_variant.33.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3.x
AVRDB.menu.01_variant.33.upload.maximum_data_size=4096
AVRDB.menu.01_variant.33.upload.maximum_size=32256
AVRDB.menu.01_variant.33=28pin AVR32DA28 (32KiB+4KiB)
AVRDB.menu.02_clock.01.bootloader.bod_sample=0
AVRDB.menu.02_clock.01.build.f_cpu=24000000L
AVRDB.menu.02_clock.01=Internal 24 MHz (default)
AVRDB.menu.02_clock.02.bootloader.bod_sample=0
AVRDB.menu.02_clock.02.build.f_cpu=12000000L
AVRDB.menu.02_clock.02=Internal 12 MHz
AVRDB.menu.02_clock.03.bootloader.bod_sample=0
AVRDB.menu.02_clock.03.build.f_cpu=6000000L
AVRDB.menu.02_clock.03=Internal 6 MHz
AVRDB.menu.02_clock.04.bootloader.bod_sample=0
AVRDB.menu.02_clock.04.build.f_cpu=3000000L
AVRDB.menu.02_clock.04=Internal 3 MHz
AVRDB.menu.02_clock.10=-
AVRDB.menu.02_clock.11.bootloader.bod_sample=0
AVRDB.menu.02_clock.11.build.f_cpu=20000000L
AVRDB.menu.02_clock.11=Internal 20 MHz
AVRDB.menu.02_clock.12.bootloader.bod_sample=0
AVRDB.menu.02_clock.12.build.f_cpu=10000000L
AVRDB.menu.02_clock.12=Internal 10 MHz
AVRDB.menu.02_clock.13.bootloader.bod_sample=0
AVRDB.menu.02_clock.13.build.f_cpu=5000000L
AVRDB.menu.02_clock.13=Internal 5 MHz
AVRDB.menu.02_clock.20=-
AVRDB.menu.02_clock.21.bootloader.bod_sample=0
AVRDB.menu.02_clock.21.build.f_cpu=16000000L
AVRDB.menu.02_clock.21=Internal 16 MHz
AVRDB.menu.02_clock.22.bootloader.bod_sample=0
AVRDB.menu.02_clock.22.build.f_cpu=8000000L
AVRDB.menu.02_clock.22=Internal 8 MHz
AVRDB.menu.02_clock.23.bootloader.bod_sample=0
AVRDB.menu.02_clock.23.build.f_cpu=4000000L
AVRDB.menu.02_clock.23=Internal 4 MHz
AVRDB.menu.02_clock.24.bootloader.bod_sample=0
AVRDB.menu.02_clock.24.build.f_cpu=2000000L
AVRDB.menu.02_clock.24=Internal 2 MHz
AVRDB.menu.02_clock.25.bootloader.bod_sample=0
AVRDB.menu.02_clock.25.build.f_cpu=1000000L
AVRDB.menu.02_clock.25=Internal 1 MHz
AVRDB.menu.02_clock.30=-
AVRDB.menu.02_clock.31.bootloader.bod_sample=0
AVRDB.menu.02_clock.31.build.f_cpu=32000000L
AVRDB.menu.02_clock.31=Internal 32 MHz (OVERCLOCK)
AVRDB.menu.02_clock.32.bootloader.bod_sample=0
AVRDB.menu.02_clock.32.build.f_cpu=28000000L
AVRDB.menu.02_clock.32=Internal 28 MHz (OVERCLOCK)
AVRDB.menu.02_clock.33.bootloader.bod_sample=0
AVRDB.menu.02_clock.33.build.f_cpu=14000000L
AVRDB.menu.02_clock.33=Internal 14 MHz (OVERCLOCK)
AVRDB.menu.02_clock.34.bootloader.bod_sample=0
AVRDB.menu.02_clock.34.build.f_cpu=7000000L
AVRDB.menu.02_clock.34=Internal 7 MHz (OVERCLOCK)
AVRDB.menu.02_clock.40=-
AVRDB.menu.02_clock.41.bootloader.bod_sample=1
AVRDB.menu.02_clock.41.build.f_cpu=32768
AVRDB.menu.02_clock.41=Internal 32.768 kHz (ULP)
AVRDB.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
AVRDB.menu.11_BODMODE.01_disabled=BOD Disabled
AVRDB.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
AVRDB.menu.11_BODMODE.02_enabled=BOD Enabled
AVRDB.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
AVRDB.menu.11_BODMODE.03_sampled=BOD Sampled
AVRDB.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
AVRDB.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
AVRDB.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
AVRDB.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
AVRDB.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
AVRDB.menu.12_BODLVL.BODLEVEL1=Level 2.45V
AVRDB.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
AVRDB.menu.12_BODLVL.BODLEVEL2=Level 2.7V
AVRDB.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
AVRDB.menu.12_BODLVL.BODLEVEL3=Level 2.85V
AVRDB.menu.21_resetpin.01_reset.bootloader.reset_bit=10
AVRDB.menu.21_resetpin.01_reset=PF6 pin=Reset
AVRDB.menu.21_resetpin.02_gpio.bootloader.reset_bit=00
AVRDB.menu.21_resetpin.02_gpio=PF6 pin=GPIO (input only)
AVRDB.menu.23_eeprom.01_keep.bootloader.eesave_bit=1
AVRDB.menu.23_eeprom.01_keep=Save guard "Retained"
AVRDB.menu.23_eeprom.02_erase.bootloader.eesave_bit=0
AVRDB.menu.23_eeprom.02_erase=Save guard "Erase"
AVRDB.menu.23_eeprom.03_replace.bootloader.eepupload={bootloader.eeprom}
AVRDB.menu.23_eeprom.03_replace.bootloader.eesave_bit=1
AVRDB.menu.23_eeprom.03_replace="Erase" and "Replace"
AVRDB.menu.24_mvsyscfg.01_dual.bootloader.mvsys_bit=01
AVRDB.menu.24_mvsyscfg.01_dual=MVIO "Dual" (default)
AVRDB.menu.24_mvsyscfg.02_single.bootloader.mvsys_bit=10
AVRDB.menu.24_mvsyscfg.02_single=MVIO "Single"
AVRDB.menu.51_buildopt.01_Release=Build Release (default)
AVRDB.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
AVRDB.menu.51_buildopt.02_Debug1=Build DEBUG=1
AVRDB.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
AVRDB.menu.51_buildopt.03_Debug2=Build DEBUG=2
AVRDB.menu.52_macroapi.01_Enable=Macro API Enable (default)
AVRDB.menu.52_macroapi.02_Disable.build.macroapi=
AVRDB.menu.52_macroapi.02_Disable=Macro API Disable
AVRDB.menu.52_macroapi.03_AllDisable.build.macroapi=
AVRDB.menu.52_macroapi.03_AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRDB.menu.52_macroapi.03_AllDisable=Standard Library All Disable
AVRDB.menu.53_printf.01_default=default
AVRDB.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
AVRDB.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDB.menu.53_printf.02_full=Float Support
AVRDB.menu.90_console_baud.01.build.console_baud=-DCONSOLE_BAUD=9600
AVRDB.menu.90_console_baud.01=CONSOLE_BAUD=9600 bps (default)
AVRDB.menu.90_console_baud.03.build.console_baud=-DCONSOLE_BAUD=38400
AVRDB.menu.90_console_baud.03=CONSOLE_BAUD=38400 bps
AVRDB.menu.90_console_baud.04.build.console_baud=-DCONSOLE_BAUD=57600
AVRDB.menu.90_console_baud.04=CONSOLE_BAUD=57600 bps
AVRDB.menu.90_console_baud.05.build.console_baud=-DCONSOLE_BAUD=115200
AVRDB.menu.90_console_baud.05=CONSOLE_BAUD=115200 bps
AVRDB.menu.90_console_baud.06.build.console_baud=-DCONSOLE_BAUD=230400
AVRDB.menu.90_console_baud.06=CONSOLE_BAUD=230400 bps
AVRDB.menu.90_console_baud.15.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDB.menu.90_console_baud.15=CONSOLE_BAUD=1000000 bps
AVRDB.menu.90_console_baud.20=-
AVRDB.menu.90_console_baud.21.build.console_baud=-DCONSOLE_BAUD=2400
AVRDB.menu.90_console_baud.21=CONSOLE_BAUD=2400 bps (for ULP)
AVRDB.menu.95_bootloader.01.bootloader.file=hex/boot_avrdx_UART0_A0_{upload.speed}_LA7.hex
AVRDB.menu.95_bootloader.01.build.console_select=-DSerial=Serial0A
AVRDB.menu.95_bootloader.01=UART0 TX:PA0 RX:PA1 LED=PA7 (default)
AVRDB.menu.95_bootloader.10=-
AVRDB.menu.95_bootloader.11.bootloader.file=hex/boot_avrdx_UART2_F0_{upload.speed}_LA7.hex
AVRDB.menu.95_bootloader.11.build.console_select=-DSerial=Serial2A
AVRDB.menu.95_bootloader.11=UART2 TX:PF0 RX:PF1 LED=PA7 (32/48/64pin)
AVRDB.menu.95_bootloader.23.bootloader.file=hex/boot_avrdx_UART2_F4_{upload.speed}_LA7.hex
AVRDB.menu.95_bootloader.23.build.console_select=-DSerial=Serial2B
AVRDB.menu.95_bootloader.23=UART2 TX:PF4 RX:PF5 LED=PA7 (32/48/64pin)


