askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDD.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDD.bootloader.BOOTSIZE=0x01
AVRDD.bootloader.CODESIZE=0x00
AVRDD.bootloader.OSCCFG=0b00000000
AVRDD.bootloader.SYSCFG0=0b110{bootloader.updi_bit}{bootloader.reset_bit}0{bootloader.eesave_bit}
AVRDD.bootloader.SYSCFG1=0b0000{bootloader.mvsys_bit}000
AVRDD.bootloader.WDTCFG=0b00000000
AVRDD.bootloader.bod_lvl=000
AVRDD.bootloader.bod_mode=00
AVRDD.bootloader.bod_sample=0
AVRDD.bootloader.tool=avrdude
AVRDD.bootloader.eepupload=
AVRDD.bootloader.eesave_bit=1
AVRDD.bootloader.mvsys_bit=01
AVRDD.bootloader.reset_bit=10
AVRDD.bootloader.updi_bit=1
AVRDD.bootloader.programed_type=.with_bootloader
AVRDD.build.export_merged_output=true
AVRDD.build.text_section_start=.text=0x200
AVRDD.build.buildopt=-DNDEBUG
AVRDD.build.console_baud=-DCONSOLE_BAUD=9600
AVRDD.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVRDD.build.macroapi=-DENABLE_MACRO_API
AVRDD.build.printf=
AVRDD.build.printflt=
AVRDD.upload.protocol=arduino
AVRDD.upload.speed=115200
AVRDD.upload.tool=avrdude
AVRDD.menu.01_variant.22.build.board=AVR_AVR64DD32
AVRDD.menu.01_variant.22.build.mcu=avr64dd32
AVRDD.menu.01_variant.22.build.variant=avr_dd32
AVRDD.menu.01_variant.22.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2.x
AVRDD.menu.01_variant.22.upload.maximum_data_size=8192
AVRDD.menu.01_variant.22.upload.maximum_size=65024
AVRDD.menu.01_variant.22=32pin AVR64DD32 (64KiB+8KiB)
AVRDD.menu.01_variant.23.build.board=AVR_AVR32DD32
AVRDD.menu.01_variant.23.build.mcu=avr32dd32
AVRDD.menu.01_variant.23.build.variant=avr_dd32
AVRDD.menu.01_variant.23.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3.x
AVRDD.menu.01_variant.23.upload.maximum_data_size=4096
AVRDD.menu.01_variant.23.upload.maximum_size=32256
AVRDD.menu.01_variant.23=32pin AVR32DD32 (32KiB+4KiB)
AVRDD.menu.01_variant.24.build.board=AVR_AVR16DD32
AVRDD.menu.01_variant.24.build.mcu=avr16dd32
AVRDD.menu.01_variant.24.build.variant=avr_dd32
AVRDD.menu.01_variant.24.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3.x
AVRDD.menu.01_variant.24.upload.maximum_data_size=2048
AVRDD.menu.01_variant.24.upload.maximum_size=15872
AVRDD.menu.01_variant.24=32pin AVR16DD32 (16KiB+2KiB)
AVRDD.menu.01_variant.30=-
AVRDD.menu.01_variant.32.build.board=AVR_AVR64DD28
AVRDD.menu.01_variant.32.build.mcu=avr64dd28
AVRDD.menu.01_variant.32.build.variant=avr_dd28
AVRDD.menu.01_variant.32.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2.x
AVRDD.menu.01_variant.32.upload.maximum_data_size=8192
AVRDD.menu.01_variant.32.upload.maximum_size=65024
AVRDD.menu.01_variant.32=28pin AVR64DD28 (64KiB+8KiB)
AVRDD.menu.01_variant.33.build.board=AVR_AVR32DD28
AVRDD.menu.01_variant.33.build.mcu=avr32dd28
AVRDD.menu.01_variant.33.build.variant=avr_dd28
AVRDD.menu.01_variant.33.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3.x
AVRDD.menu.01_variant.33.upload.maximum_data_size=4096
AVRDD.menu.01_variant.33.upload.maximum_size=32256
AVRDD.menu.01_variant.33=28pin AVR32DD28 (32KiB+4KiB)
AVRDD.menu.01_variant.34.build.board=AVR_AVR16DD28
AVRDD.menu.01_variant.34.build.mcu=avr16dd28
AVRDD.menu.01_variant.34.build.variant=avr_dd28
AVRDD.menu.01_variant.34.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3.x
AVRDD.menu.01_variant.34.upload.maximum_data_size=2048
AVRDD.menu.01_variant.34.upload.maximum_size=15872
AVRDD.menu.01_variant.34=28pin AVR16DD28 (16KiB+2KiB)
AVRDD.menu.01_variant.40=-
AVRDD.menu.01_variant.42.build.board=AVR_AVR64DD20
AVRDD.menu.01_variant.42.build.mcu=avr64dd20
AVRDD.menu.01_variant.42.build.variant=avr_dd20
AVRDD.menu.01_variant.42.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2.x
AVRDD.menu.01_variant.42.upload.maximum_data_size=8192
AVRDD.menu.01_variant.42.upload.maximum_size=65024
AVRDD.menu.01_variant.42=20pin AVR64DD20 (64KiB+8KiB)
AVRDD.menu.01_variant.43.build.board=AVR_AVR32DD20
AVRDD.menu.01_variant.43.build.mcu=avr32dd20
AVRDD.menu.01_variant.43.build.variant=avr_dd20
AVRDD.menu.01_variant.43.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3.x
AVRDD.menu.01_variant.43.upload.maximum_data_size=4096
AVRDD.menu.01_variant.43.upload.maximum_size=32256
AVRDD.menu.01_variant.43=20pin AVR32DD20 (32KiB+4KiB)
AVRDD.menu.01_variant.44.build.board=AVR_AVR16DD20
AVRDD.menu.01_variant.44.build.mcu=avr16dd20
AVRDD.menu.01_variant.44.build.variant=avr_dd20
AVRDD.menu.01_variant.44.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3.x
AVRDD.menu.01_variant.44.upload.maximum_data_size=2048
AVRDD.menu.01_variant.44.upload.maximum_size=15872
AVRDD.menu.01_variant.44=20pin AVR16DD20 (16KiB+2KiB)
AVRDD.menu.02_clock.01.bootloader.bod_sample=0
AVRDD.menu.02_clock.01.build.f_cpu=24000000L
AVRDD.menu.02_clock.01=Internal 24 MHz (default)
AVRDD.menu.02_clock.02.bootloader.bod_sample=0
AVRDD.menu.02_clock.02.build.f_cpu=12000000L
AVRDD.menu.02_clock.02=Internal 12 MHz
AVRDD.menu.02_clock.03.bootloader.bod_sample=0
AVRDD.menu.02_clock.03.build.f_cpu=6000000L
AVRDD.menu.02_clock.03=Internal 6 MHz
AVRDD.menu.02_clock.04.bootloader.bod_sample=0
AVRDD.menu.02_clock.04.build.f_cpu=3000000L
AVRDD.menu.02_clock.04=Internal 3 MHz
AVRDD.menu.02_clock.10=-
AVRDD.menu.02_clock.11.bootloader.bod_sample=0
AVRDD.menu.02_clock.11.build.f_cpu=20000000L
AVRDD.menu.02_clock.11=Internal 20 MHz
AVRDD.menu.02_clock.12.bootloader.bod_sample=0
AVRDD.menu.02_clock.12.build.f_cpu=10000000L
AVRDD.menu.02_clock.12=Internal 10 MHz
AVRDD.menu.02_clock.13.bootloader.bod_sample=0
AVRDD.menu.02_clock.13.build.f_cpu=5000000L
AVRDD.menu.02_clock.13=Internal 5 MHz
AVRDD.menu.02_clock.20=-
AVRDD.menu.02_clock.21.bootloader.bod_sample=0
AVRDD.menu.02_clock.21.build.f_cpu=16000000L
AVRDD.menu.02_clock.21=Internal 16 MHz
AVRDD.menu.02_clock.22.bootloader.bod_sample=0
AVRDD.menu.02_clock.22.build.f_cpu=8000000L
AVRDD.menu.02_clock.22=Internal 8 MHz
AVRDD.menu.02_clock.23.bootloader.bod_sample=0
AVRDD.menu.02_clock.23.build.f_cpu=4000000L
AVRDD.menu.02_clock.23=Internal 4 MHz
AVRDD.menu.02_clock.24.bootloader.bod_sample=0
AVRDD.menu.02_clock.24.build.f_cpu=2000000L
AVRDD.menu.02_clock.24=Internal 2 MHz
AVRDD.menu.02_clock.25.bootloader.bod_sample=0
AVRDD.menu.02_clock.25.build.f_cpu=1000000L
AVRDD.menu.02_clock.25=Internal 1 MHz
AVRDD.menu.02_clock.30=-
AVRDD.menu.02_clock.31.bootloader.bod_sample=0
AVRDD.menu.02_clock.31.build.f_cpu=32000000L
AVRDD.menu.02_clock.31=Internal 32 MHz (OVERCLOCK)
AVRDD.menu.02_clock.32.bootloader.bod_sample=0
AVRDD.menu.02_clock.32.build.f_cpu=28000000L
AVRDD.menu.02_clock.32=Internal 28 MHz (OVERCLOCK)
AVRDD.menu.02_clock.33.bootloader.bod_sample=0
AVRDD.menu.02_clock.33.build.f_cpu=14000000L
AVRDD.menu.02_clock.33=Internal 14 MHz (OVERCLOCK)
AVRDD.menu.02_clock.34.bootloader.bod_sample=0
AVRDD.menu.02_clock.34.build.f_cpu=7000000L
AVRDD.menu.02_clock.34=Internal 7 MHz (OVERCLOCK)
AVRDD.menu.02_clock.40=-
AVRDD.menu.02_clock.41.bootloader.bod_sample=1
AVRDD.menu.02_clock.41.build.f_cpu=32256
AVRDD.menu.02_clock.41=Internal 32.768 kHz (ULP)
AVRDD.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
AVRDD.menu.11_BODMODE.01_disabled=BOD Disabled
AVRDD.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
AVRDD.menu.11_BODMODE.02_enabled=BOD Enabled
AVRDD.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
AVRDD.menu.11_BODMODE.03_sampled=BOD Sampled
AVRDD.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
AVRDD.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
AVRDD.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
AVRDD.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
AVRDD.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
AVRDD.menu.12_BODLVL.BODLEVEL1=Level 2.45V
AVRDD.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
AVRDD.menu.12_BODLVL.BODLEVEL2=Level 2.7V
AVRDD.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
AVRDD.menu.12_BODLVL.BODLEVEL3=Level 2.85V
AVRDD.menu.21_resetpin.01_reset.bootloader.reset_bit=10
AVRDD.menu.21_resetpin.01_reset=PF6 pin=Reset
AVRDD.menu.21_resetpin.02_gpio.bootloader.reset_bit=00
AVRDD.menu.21_resetpin.02_gpio=PF6 pin=GPIO (input only)
AVRDD.menu.22_updipin.01_updi.bootloader.updi_bit=1
AVRDD.menu.22_updipin.01_updi=PF7 pin=UPDI (default)
AVRDD.menu.22_updipin.02_gpio.bootloader.updi_bit=0
AVRDD.menu.22_updipin.02_gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)
AVRDD.menu.23_eeprom.01_keep.bootloader.eesave_bit=1
AVRDD.menu.23_eeprom.01_keep=Save guard "Retained"
AVRDD.menu.23_eeprom.02_erase.bootloader.eesave_bit=0
AVRDD.menu.23_eeprom.02_erase=Save guard "Erase"
AVRDD.menu.23_eeprom.03_replace.bootloader.eepupload={bootloader.eeprom}
AVRDD.menu.23_eeprom.03_replace.bootloader.eesave_bit=1
AVRDD.menu.23_eeprom.03_replace="Erase" and "Replace"
AVRDD.menu.24_mvsyscfg.01_dual.bootloader.mvsys_bit=01
AVRDD.menu.24_mvsyscfg.01_dual=MVIO "Dual" (default)
AVRDD.menu.24_mvsyscfg.02_single.bootloader.mvsys_bit=10
AVRDD.menu.24_mvsyscfg.02_single=MVIO "Single"
AVRDD.menu.51_buildopt.01_Release=Build Release (default)
AVRDD.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
AVRDD.menu.51_buildopt.02_Debug1=Build DEBUG=1
AVRDD.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
AVRDD.menu.51_buildopt.03_Debug2=Build DEBUG=2
AVRDD.menu.52_macroapi.01_Enable=Macro API Enable (default)
AVRDD.menu.52_macroapi.02_Disable.build.macroapi=
AVRDD.menu.52_macroapi.02_Disable=Macro API Disable
AVRDD.menu.52_macroapi.03_AllDisable.build.macroapi=
AVRDD.menu.52_macroapi.03_AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRDD.menu.52_macroapi.03_AllDisable=Standard Library All Disable
AVRDD.menu.53_printf.01_default=default
AVRDD.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
AVRDD.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDD.menu.53_printf.02_full=Float Support
AVRDD.menu.90_console_baud.01.build.console_baud=-DCONSOLE_BAUD=9600
AVRDD.menu.90_console_baud.01=CONSOLE_BAUD=9600 bps (default)
AVRDD.menu.90_console_baud.03.build.console_baud=-DCONSOLE_BAUD=38400
AVRDD.menu.90_console_baud.03=CONSOLE_BAUD=38400 bps
AVRDD.menu.90_console_baud.04.build.console_baud=-DCONSOLE_BAUD=57600
AVRDD.menu.90_console_baud.04=CONSOLE_BAUD=57600 bps
AVRDD.menu.90_console_baud.05.build.console_baud=-DCONSOLE_BAUD=115200
AVRDD.menu.90_console_baud.05=CONSOLE_BAUD=115200 bps
AVRDD.menu.90_console_baud.06.build.console_baud=-DCONSOLE_BAUD=230400
AVRDD.menu.90_console_baud.06=CONSOLE_BAUD=230400 bps
AVRDD.menu.90_console_baud.15.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDD.menu.90_console_baud.15=CONSOLE_BAUD=1000000 bps
AVRDD.menu.90_console_baud.20=-
AVRDD.menu.90_console_baud.21.build.console_baud=-DCONSOLE_BAUD=2400
AVRDD.menu.90_console_baud.21=CONSOLE_BAUD=2400 bps (for ULP)
AVRDD.menu.95_bootloader.01.bootloader.file=hex/boot_avrdx_UART0_A0_{upload.speed}_LA7.hex
AVRDD.menu.95_bootloader.01.build.console_select=-DSerial=Serial0A
AVRDD.menu.95_bootloader.01=UART0 TX:PA0 RX:PA1 LED=PA7 (default)


