askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDD14.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDD14.bootloader.BOOTSIZE=0x01
AVRDD14.bootloader.CODESIZE=0x00
AVRDD14.bootloader.OSCCFG=0b00000000
AVRDD14.bootloader.SYSCFG0=0b110{bootloader.updi_bit}{bootloader.reset_bit}0{bootloader.eesave_bit}
AVRDD14.bootloader.SYSCFG1=0b0000{bootloader.mvsys_bit}000
AVRDD14.bootloader.WDTCFG=0b00000000
AVRDD14.bootloader.bod_lvl=000
AVRDD14.bootloader.bod_mode=00
AVRDD14.bootloader.bod_sample=0
AVRDD14.bootloader.tool=avrdude
AVRDD14.bootloader.eepupload=
AVRDD14.bootloader.eesave_bit=1
AVRDD14.bootloader.mvsys_bit=01
AVRDD14.bootloader.reset_bit=10
AVRDD14.bootloader.updi_bit=1
AVRDD14.bootloader.programed_type=.with_bootloader
AVRDD14.build.export_merged_output=true
AVRDD14.build.text_section_start=.text=0x200
AVRDD14.build.buildopt=-DNDEBUG
AVRDD14.build.console_baud=-DCONSOLE_BAUD=9600
AVRDD14.build.led_pin=-DLED_BUILTIN=PIN_PD7
AVRDD14.build.macroapi=-DENABLE_MACRO_API
AVRDD14.build.printf=
AVRDD14.build.printflt=
AVRDD14.upload.protocol=arduino
AVRDD14.upload.speed=115200
AVRDD14.upload.tool=avrdude
AVRDD14.menu.01_variant.52.build.board=AVR_AVR64DD14
AVRDD14.menu.01_variant.52.build.mcu=avr64dd14
AVRDD14.menu.01_variant.52.build.variant=avr_dd14
AVRDD14.menu.01_variant.52.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2.x
AVRDD14.menu.01_variant.52.upload.maximum_data_size=8192
AVRDD14.menu.01_variant.52.upload.maximum_size=65024
AVRDD14.menu.01_variant.52=14pin AVR64DD14 (64KiB+8KiB)
AVRDD14.menu.01_variant.53.build.board=AVR_AVR32DD14
AVRDD14.menu.01_variant.53.build.mcu=avr32dd14
AVRDD14.menu.01_variant.53.build.variant=avr_dd14
AVRDD14.menu.01_variant.53.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3.x
AVRDD14.menu.01_variant.53.upload.maximum_data_size=4096
AVRDD14.menu.01_variant.53.upload.maximum_size=32256
AVRDD14.menu.01_variant.53=14pin AVR32DD14 (32KiB+4KiB)
AVRDD14.menu.01_variant.54.build.board=AVR_AVR16DD14
AVRDD14.menu.01_variant.54.build.mcu=avr16dd14
AVRDD14.menu.01_variant.54.build.variant=avr_dd14
AVRDD14.menu.01_variant.54.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3.x
AVRDD14.menu.01_variant.54.upload.maximum_data_size=2048
AVRDD14.menu.01_variant.54.upload.maximum_size=15872
AVRDD14.menu.01_variant.54=14pin AVR16DD14 (16KiB+2KiB)
AVRDD14.menu.02_clock.01.bootloader.bod_sample=0
AVRDD14.menu.02_clock.01.build.f_cpu=24000000L
AVRDD14.menu.02_clock.01=Internal 24 MHz (default)
AVRDD14.menu.02_clock.02.bootloader.bod_sample=0
AVRDD14.menu.02_clock.02.build.f_cpu=12000000L
AVRDD14.menu.02_clock.02=Internal 12 MHz
AVRDD14.menu.02_clock.03.bootloader.bod_sample=0
AVRDD14.menu.02_clock.03.build.f_cpu=6000000L
AVRDD14.menu.02_clock.03=Internal 6 MHz
AVRDD14.menu.02_clock.04.bootloader.bod_sample=0
AVRDD14.menu.02_clock.04.build.f_cpu=3000000L
AVRDD14.menu.02_clock.04=Internal 3 MHz
AVRDD14.menu.02_clock.10=-
AVRDD14.menu.02_clock.11.bootloader.bod_sample=0
AVRDD14.menu.02_clock.11.build.f_cpu=20000000L
AVRDD14.menu.02_clock.11=Internal 20 MHz
AVRDD14.menu.02_clock.12.bootloader.bod_sample=0
AVRDD14.menu.02_clock.12.build.f_cpu=10000000L
AVRDD14.menu.02_clock.12=Internal 10 MHz
AVRDD14.menu.02_clock.13.bootloader.bod_sample=0
AVRDD14.menu.02_clock.13.build.f_cpu=5000000L
AVRDD14.menu.02_clock.13=Internal 5 MHz
AVRDD14.menu.02_clock.20=-
AVRDD14.menu.02_clock.21.bootloader.bod_sample=0
AVRDD14.menu.02_clock.21.build.f_cpu=16000000L
AVRDD14.menu.02_clock.21=Internal 16 MHz
AVRDD14.menu.02_clock.22.bootloader.bod_sample=0
AVRDD14.menu.02_clock.22.build.f_cpu=8000000L
AVRDD14.menu.02_clock.22=Internal 8 MHz
AVRDD14.menu.02_clock.23.bootloader.bod_sample=0
AVRDD14.menu.02_clock.23.build.f_cpu=4000000L
AVRDD14.menu.02_clock.23=Internal 4 MHz
AVRDD14.menu.02_clock.24.bootloader.bod_sample=0
AVRDD14.menu.02_clock.24.build.f_cpu=2000000L
AVRDD14.menu.02_clock.24=Internal 2 MHz
AVRDD14.menu.02_clock.25.bootloader.bod_sample=0
AVRDD14.menu.02_clock.25.build.f_cpu=1000000L
AVRDD14.menu.02_clock.25=Internal 1 MHz
AVRDD14.menu.02_clock.30=-
AVRDD14.menu.02_clock.31.bootloader.bod_sample=0
AVRDD14.menu.02_clock.31.build.f_cpu=32000000L
AVRDD14.menu.02_clock.31=Internal 32 MHz (OVERCLOCK)
AVRDD14.menu.02_clock.32.bootloader.bod_sample=0
AVRDD14.menu.02_clock.32.build.f_cpu=28000000L
AVRDD14.menu.02_clock.32=Internal 28 MHz (OVERCLOCK)
AVRDD14.menu.02_clock.33.bootloader.bod_sample=0
AVRDD14.menu.02_clock.33.build.f_cpu=14000000L
AVRDD14.menu.02_clock.33=Internal 14 MHz (OVERCLOCK)
AVRDD14.menu.02_clock.34.bootloader.bod_sample=0
AVRDD14.menu.02_clock.34.build.f_cpu=7000000L
AVRDD14.menu.02_clock.34=Internal 7 MHz (OVERCLOCK)
AVRDD14.menu.02_clock.40=-
AVRDD14.menu.02_clock.41.bootloader.bod_sample=1
AVRDD14.menu.02_clock.41.build.f_cpu=32256
AVRDD14.menu.02_clock.41=Internal 32.768 kHz (ULP)
AVRDD14.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
AVRDD14.menu.11_BODMODE.01_disabled=BOD Disabled
AVRDD14.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
AVRDD14.menu.11_BODMODE.02_enabled=BOD Enabled
AVRDD14.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
AVRDD14.menu.11_BODMODE.03_sampled=BOD Sampled
AVRDD14.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
AVRDD14.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
AVRDD14.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
AVRDD14.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
AVRDD14.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
AVRDD14.menu.12_BODLVL.BODLEVEL1=Level 2.45V
AVRDD14.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
AVRDD14.menu.12_BODLVL.BODLEVEL2=Level 2.7V
AVRDD14.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
AVRDD14.menu.12_BODLVL.BODLEVEL3=Level 2.85V
AVRDD14.menu.21_resetpin.01_reset.bootloader.reset_bit=10
AVRDD14.menu.21_resetpin.01_reset=PF6 pin=Reset
AVRDD14.menu.21_resetpin.02_gpio.bootloader.reset_bit=00
AVRDD14.menu.21_resetpin.02_gpio=PF6 pin=GPIO (input only)
AVRDD14.menu.22_updipin.01_updi.bootloader.updi_bit=1
AVRDD14.menu.22_updipin.01_updi=PF7 pin=UPDI (default)
AVRDD14.menu.22_updipin.02_gpio.bootloader.updi_bit=0
AVRDD14.menu.22_updipin.02_gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)
AVRDD14.menu.23_eeprom.01_keep.bootloader.eesave_bit=1
AVRDD14.menu.23_eeprom.01_keep=Save guard "Retained"
AVRDD14.menu.23_eeprom.02_erase.bootloader.eesave_bit=0
AVRDD14.menu.23_eeprom.02_erase=Save guard "Erase"
AVRDD14.menu.23_eeprom.03_replace.bootloader.eepupload={bootloader.eeprom}
AVRDD14.menu.23_eeprom.03_replace.bootloader.eesave_bit=1
AVRDD14.menu.23_eeprom.03_replace="Erase" and "Replace"
AVRDD14.menu.24_mvsyscfg.01_dual.bootloader.mvsys_bit=01
AVRDD14.menu.24_mvsyscfg.01_dual=MVIO "Dual" (default)
AVRDD14.menu.24_mvsyscfg.02_single.bootloader.mvsys_bit=10
AVRDD14.menu.24_mvsyscfg.02_single=MVIO "Single"
AVRDD14.menu.51_buildopt.01_Release=Build Release (default)
AVRDD14.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
AVRDD14.menu.51_buildopt.02_Debug1=Build DEBUG=1
AVRDD14.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
AVRDD14.menu.51_buildopt.03_Debug2=Build DEBUG=2
AVRDD14.menu.52_macroapi.01_Enable=Macro API Enable (default)
AVRDD14.menu.52_macroapi.02_Disable.build.macroapi=
AVRDD14.menu.52_macroapi.02_Disable=Macro API Disable
AVRDD14.menu.52_macroapi.03_AllDisable.build.macroapi=
AVRDD14.menu.52_macroapi.03_AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRDD14.menu.52_macroapi.03_AllDisable=Standard Library All Disable
AVRDD14.menu.53_printf.01_default=default
AVRDD14.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
AVRDD14.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDD14.menu.53_printf.02_full=Float Support
AVRDD14.menu.90_console_baud.01.build.console_baud=-DCONSOLE_BAUD=9600
AVRDD14.menu.90_console_baud.01=CONSOLE_BAUD=9600 bps (default)
AVRDD14.menu.90_console_baud.03.build.console_baud=-DCONSOLE_BAUD=38400
AVRDD14.menu.90_console_baud.03=CONSOLE_BAUD=38400 bps
AVRDD14.menu.90_console_baud.04.build.console_baud=-DCONSOLE_BAUD=57600
AVRDD14.menu.90_console_baud.04=CONSOLE_BAUD=57600 bps
AVRDD14.menu.90_console_baud.05.build.console_baud=-DCONSOLE_BAUD=115200
AVRDD14.menu.90_console_baud.05=CONSOLE_BAUD=115200 bps
AVRDD14.menu.90_console_baud.06.build.console_baud=-DCONSOLE_BAUD=230400
AVRDD14.menu.90_console_baud.06=CONSOLE_BAUD=230400 bps
AVRDD14.menu.90_console_baud.15.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDD14.menu.90_console_baud.15=CONSOLE_BAUD=1000000 bps
AVRDD14.menu.90_console_baud.20=-
AVRDD14.menu.90_console_baud.21.build.console_baud=-DCONSOLE_BAUD=2400
AVRDD14.menu.90_console_baud.21=CONSOLE_BAUD=2400 bps (for ULP)
AVRDD14.menu.95_bootloader.01.bootloader.file=hex/boot_avrdd_UART0_A0_{upload.speed}_LD7.hex
AVRDD14.menu.95_bootloader.01.build.console_select=-DSerial=Serial0A
AVRDD14.menu.95_bootloader.01=UART0 TX:PA0 RX:PA1 LED=PD7 (default)


